Revit 2027 API
LoadCase.Number Property
 Returns unique load case number.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Number { get; set; }
Public Property Number As Integer
	Get
	Set
public:
property int Number {
	int get ();
	void set (int value);
}
member Number : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given number is not unique.
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace